[
    {
        "Level number":1,
        "Nutshell statement":"Have an awareness of quantity and attend to properties of objects",
        "Conceptual understanding":"Learners understand the concept of quantity and that number symbols and names are used to represent quantities. They can recognise one-digit number symbols and use one-digit number names. Learners understand that objects and groups of objects have properties such as length and colour.",
        "Procedural fluency":"Learners can count and order objects in small sets. They can classify and sort familiar objects by their properties.",
        "Strategic competence":"Learners can plan and execute a task such as sorting objects by type, shape, size or other property.",
        "Adaptive reasoning":"Learners use properties of objects to compare them, and they use informal quantitative and geometric language (eg more, longer) to describe what they observe. They also recognise repetition in the context of simple number patterns, geometric patterns, and the events of their everyday lives."
    },
    {
        "Level number":2,
        "Nutshell statement":"Informally explore and describe the composition of small numbers and the properties of objects",
        "Conceptual understanding":"Learners can recognise and use two-digit number symbols and number names. They understand that numbers can be partitioned in different ways. Learners are becoming sensitive to properties such as cardinality, magnitude, shape, order, pattern and regularity, and are beginning to understand that these properties can be used to describe, manipulate and in some cases define mathematical objects.",
        "Procedural fluency":"Learners model arithmetic processes with concrete objects and use mental strategies such as counting on, grouping and sharing. They can compose and decompose simple shapes. They can recognise and describe mathematical properties of two-dimensional shapes such as number or straightness of edges, and can read simple pictographs as representations of counts.",
        "Strategic competence":"Learners can choose an appropriate strategy for solving a number problem involving a single addition or subtraction in a familiar context.",
        "Adaptive reasoning":"Learners compare objects quantitatively using language such as 'more', 'fewer', 'equal', 'two less than'; events in time are compared using language such as before/after, older/younger. They can reason about repeating patterns of two elements. They can connect familiar objects with their representations; for example, a box and a picture of a box."
    },
    {
        "Level number":3,
        "Nutshell statement":"Understand place value, and quantify measurable properties using informal units",
        "Conceptual understanding":"Learners understand that numbers can represent order, cardinality and magnitude. They understand the concept of place value as it applies to two-digit whole numbers. Learners understand that properties such as length, mass, volume, count, are conserved under various transformations. They also understand the concept of half as partition into equal parts, and the concept of zero as a null count. Learners are developing an understanding of the concept of units of measurement, and spatial concepts such as line symmetry. They are also developing an understanding of chance, and of location as a mathematical property.",
        "Procedural fluency":"Learners can count by ones, both backwards and forwards. They can make informal measurements of length, area, volume, angle and mass, and describe these properties and processes. They can read time to the minute on a digital clock and to the hour on an analogue clock. Learners can also use a range of informal positional language. They can classify two-dimensional shapes according to their geometric properties.",
        "Strategic competence":"Learners select appropriate strategies for such tasks as adding and subtracting two-digit numbers, comparing lengths of objects, deriving and using informal measurements (for example to estimate quantities).",
        "Adaptive reasoning":"Learners can use geometric properties such as number of edges and vertices as the basis for comparison of two-dimensional shapes. They can compare two categories in a pictograph or tally chart."
    },
    {
        "Level number":4,
        "Nutshell statement":"Explore number properties and fluently solve arithmetic problems",
        "Conceptual understanding":"Learners understand the structure of whole numbers, including the concepts of (and words related to) factoring, decomposing and rounding. They also understand the concept of zero as a reference point, and the concept and visual and symbolic representation of unit fractions. Learners understand that a calendar is a formal representation of the repeated pattern of days and months. They also understand that familiar two- and three-dimensional shapes have defining properties and properties that can vary. Learners understand the idea of chance in relation to everyday events.",
        "Procedural fluency":"Learners are becoming fluent in counting forwards and backwards in fixed steps. They can solve arithmetic problems using a variety of methods. They can measure using informal procedures and a variety of devices. They can work with maps and alphanumeric references as models for location. Learners can classify shapes by congruence and similarity and using symmetry properties. They can retrieve multiple pieces of information from pictographs and tally charts, and construct such representations for themselves.",
        "Strategic competence":"Learners identify and use efficient strategies for solving whole number arithmetic problems and select and apply strategies for measuring quantities such as length, area and volume, and for estimating such quantities.",
        "Adaptive reasoning":"Learners can reason about shapes that they have grouped or manipulated for the purposes of comparison. They can categorise everyday chance events informally (eg 'more likely', 'impossible')."
    },
    {
        "Level number":5,
        "Nutshell statement":"Perform mathematical operations, including with fractions, and evaluate if results are reasonable",
        "Conceptual understanding":"Learners understand the concept of place value as it applies to numbers with fractional parts. They understand the inverse relationships among the arithmetic operations and the concept of an unknown value in a number sentence. They understand frames of reference for describing direction. Learners are developing an understanding of abstract data representations and they understand the concept of probability experiments.",
        "Procedural fluency":"Learners can count forwards or backwards in fixed steps, starting from any number. They can find an unknown quantity in a number sentence involving addition or subtraction. They can perform the standard procedures for arithmetic operations used in familiar contexts. Learners use tools to measure length, area, volume, temperature and mass of familiar objects. They can construct and interpret complex tally charts, pictographs or column graphs.",
        "Strategic competence":"Learners can select and apply the most appropriate standard model or procedure to formulate and solve missing number equations, and arithmetic problems involving decimals. They can choose appropriate devices to measure geometric and physical properties, and choose appropriate units to record and report those measures.",
        "Adaptive reasoning":"Learners use estimation to determine if results of calculations are reasonable. They can also envisage multiple perspectives in spatial and geometric contexts and reason about the relationships among them."
    },
    {
        "Level number":6,
        "Nutshell statement":"Think multiplicatively, and work with basic formal systems for representing location and space",
        "Conceptual understanding":"Learners understand equivalences among fractions and percentages. They understand the concept of a scale image. They understand the Cartesian coordinate system as a framework for describing location. Learners distinguish right angles and straight angles from other angles. Learners understand that data categories can be labelled with numbers to represent category, order, cardinality and magnitude; and that probability can be quantified and represented with fractions.",
        "Procedural fluency":"Learners can divide when there are remainders, and work informally with rates, ratios and proportions. They can measure some geometric properties of irregular shapes and cuboid-based compound objects. Learners can also calculate distances on scale images, and interpret and use a range of positional language to solve problems. They can find unknown quantities in number sentences involving a single arithmetic operation. They can organise and represent data in a pictograph or chart.",
        "Strategic competence":"Learners can select and apply appropriate standard procedures for mathematical operations in a range of familiar and unfamiliar contexts. They design survey questions that elicit appropriately quantifiable responses.",
        "Adaptive reasoning":"Learners can use multiplicative thinking and proportional reasoning, both in informal contexts of ratios, rates and proportions, and in the context of simple multiplicative patterns. Learners can match an attribute of a three-dimensional object to the corresponding attribute on different representations of the object; for example, a net."
    },
    {
        "Level number":7,
        "Nutshell statement":"Work fluently with different types of number, and begin to use statistical and probabilistic reasoning",
        "Conceptual understanding":"Learners understand negative numbers as representations of distances 'below' or 'before' a reference point. They also understand index notation, and the inverse relationships between familiar powers (ie squares and cubes) and their roots. They understand and use the commutative, associative and distributive laws in formulating numerical calculations. They understand a functional relationship between two variables in a concrete context. Learners understand the standard linguistic prefixes of the metric system, as well as the formal names of different types of angles. They also understand that shape transformations can be expressed quantitatively. Learners understand that summary statistics can represent the key properties of datasets, and the concept of representativeness as it applies to sampling from a population. They also understand the concepts of a sample space and that probability can be represented on a continuum from 0 to 1.",
        "Procedural fluency":"Learners can add large numbers and represent remainders of divisions as fractions or decimals. They can also convert fluently between fractions, decimals and percentages. They can solve missing number equations involving more than one operation, and calculate with rates and scale factors in simple contexts. Learners can calculate probabilities and represent them using fractions, decimals and percentages. They can also enumerate a sample space, and work with a range of data representations.",
        "Strategic competence":"Learners can produce and work across multiple representations of a linear functional relationship between two variables. They can also select the most appropriate way to summarise a dataset.",
        "Adaptive reasoning":"Learners can reason with rates expressed formally. They can also recognise relationships among properties of a geometric object to quantify an unknown property (eg surface area, volume, number of vertices, faces or edges)."
    },
    {
        "Level number":8,
        "Nutshell statement":"Use mathematical conventions to manipulate quantities and explore functional relationships",
        "Conceptual understanding":"Learners understand negative and fractional index notation. They also understand how pronumerals represent numbers in mathematical expressions, including in the context of linear relationships between two variables. They understand the concept of arithmetic and geometric progression. Learners understand that there are relationships between the angles made by intersecting lines and properties of triangles including angle sums and Pythagoras's Theorem. They understand the concepts of randomness and bias in the context of sampling. They also understand the concept of statistical expectation.",
        "Procedural fluency":"Learners can perform multi-step arithmetic operations involving positive and negative numbers, proper and improper fractions, and decimals. They can fluently work with the commutative, associative and distributive laws. They can also identify and define a range of arithmetic and geometric progressions. Learners can use the angle sum of a triangle, Pythagoras’s theorem, and the formula for volume of a cuboid. They can also fluently convert between different standard units, work with scales, and describe and implement sequences of shape transformations. Learners can calculate summary statistics. They can also find and compare outcomes of chance or probability experiments when all possible outcomes can be listed as a sample space. They can also find expected outcomes of repeated probability experiments.",
        "Strategic competence":"Learners can represent functional relationships in multiple ways. They can select the most appropriate summary statistic to use in a situation.",
        "Adaptive reasoning":"Learners can reason about missing steps in a range of arithmetic and geometric progressions. They can explore proofs such as of Pythagoras’s Theorem and of simple number properties. They can infer missing values on a scale using interpolation and extrapolation. They can identify different views or representations of a three-dimensional object."
    },
    {
        "Level number":9,
        "Nutshell statement":"Work with a range of representations of functional and geometric relationships and statistical and probabilistic situations",
        "Conceptual understanding":"Learners understand common non-linear relationships. They also understand the connections between graphical and algebraic representations of functional relationships. Learners understand that mathematical theorems can be proved through a series of related logical statements. They understand the relationship among angles in a polygon. They understand that datasets have properties, and that these properties can be the basis for comparison.",
        "Procedural fluency":"Learners can work fluently with the commutative, associative and distributive laws to manipulate and solve linear algebraic expressions. They can use the Cartesian plane to explore properties of lines and calculate distances between points. They can describe and implement a range of given shape transformations. Learners can interpret a range of data representations.",
        "Strategic competence":"Learners can select appropriate expressions of rates, ratios and proportions in a range of contexts. They can select an appropriate trigonometric ratio to find an unknown length in a right-angle triangle. Learners can select appropriate representations to explore the outcomes of chance experiments.",
        "Adaptive reasoning":"Learners can use proportional reasoning in a range of contexts, including in situations involving ratios of more than two quantities. They can infer the value of missing angles in geometric constructions involving intersecting lines or polygons and explore their understanding of informal mathematical arguments with simple geometric constructions. Learners can reason about the possible outcomes of chance experiments."
    },
    {
        "Level number":10,
        "Nutshell statement":"Reason informally about functional relationships, geometric properties and statistical and probabilistic situations",
        "Conceptual understanding":"Learners know the differences between the types of number (such as natural, integer, rational, irrational). They understand and can identify the features of graphs of functional relationships. They understand simultaneous equations as representing different sets of functionally related values that may have elements in common. Learners understand the difference between theoretical and empirical probability, and that different distribution types have different properties. They also understand the concepts of dependent, independent and compound events in probability experiments.",
        "Procedural fluency":"Learners can perform calculations, and manipulate expressions involving numbers in logarithmic, index and surd form. They can also solve pairs of simultaneous linear equations. They can work with graphical and algebraic representations of quadratic functions, and solve quadratic equations. They can work with formal representations of rates, ratios and proportions, and convert between multidimensional units. Learners can represent the outcomes of probability experiments using frequency distributions, and calculate conditional probabilities.",
        "Strategic competence":"Learners can formulate and select appropriate representations to model given relationships, and extend given representations. They can select an appropriate trigonometric formula to find an unknown side length or the area for any triangle. They can select an effective method for solving quadratic equations and pairs of simultaneous equations. Learners can use estimation and approximation to monitor progress when solving a problem.",
        "Adaptive reasoning":"Learners can use estimation and approximation to evaluate solutions to problems. They can reason about geometric constructions including those based on triangles and circles, describing the steps that together make up a logical mathematical argument. They can make arguments about the congruence and similarity of triangles using conditions based on edges and angles. Learners can draw reasoned conclusions about a given dataset, drawing on information shown through different representations. They can also analyse the outcomes of probability experiments involving compound events, using laws of probability and permutations and combinations."
    },
    {
        "Level number":11,
        "Nutshell statement":"Represent, explore, connect, manipulate, extend and reason about situations and problems using a wide range of mathematical content",
        "Conceptual understanding":"Learners understand the concepts of rates of change and limits. Learners understand how to locate objects using different coordinate systems, and the features of polynomial and trigonometric functions and their graphical representations. Learners understand the difference between discrete and continuous data. They also understand the connections between the concepts of probability, randomness, bias and fairness.",
        "Procedural fluency":"Learners can calculate average and instantaneous rates of change as representations of physical change processes. They can solve a range of polynomial equations, simplify expressions that include algebraic fractions, and use formulae for arithmetic and geometric progressions. Learners can identify features of graphs of a wide range of basic functions, and explore intersections between functions using graphical and algebraic tools. Learners can work with scaled three-dimensional objects. They can solve trigonometric equations with both restricted and unlimited domains. Learners can interpret and calculate the mean and standard deviation for a small discrete data set.",
        "Strategic competence":"Learners can choose appropriately from different methods they have learnt to solve polynomial equations. They can identify the right formula for an arithmetic or geometric progression, and can select appropriate identities to solve a trigonometric equation. They can apply their knowledge of properties of geometric objects to create strategies for solving complex multi-step problems, including making appropriate simplifying assumptions, and evaluating and refining modelling processes.",
        "Adaptive reasoning":"Learners can follow simple formal proofs, and can create their own using models from geometry. They can create representations of problem situations using their knowledge of mathematical structures such as sets, number, functions, and geometric properties."
    },
    {
        "Level number":12,
        "Nutshell statement":"Formally analyse and operate on discrete and continuous functional relationships and algebraic systems ",
        "Conceptual understanding":"Learners understand the meaning of derivatives of functions and how to use calculus (including anti-differentiation) to investigate features of graphs. They are familiar with a wide range of functions and can transform them to represent them graphically. Learners understand a range of abstract algebraic systems such as complex numbers, vectors and matrices. In statistics and probability learners understand standard probability functions and the concepts of sample statistic and population parameter, and they understand the principles of combinatorics.",
        "Procedural fluency":"Learners can differentiate and anti-differentiate a range of functions including polynomial, exponential and trigonometric functions. They can use calculus to find features of functions in order to sketch their graphs. Learners can solve trigonometric equations and polynomial equations with complex roots. They can represent system relationships using matrices and vectors, and use them to solve simultaneous linear equations. Learners can calculate probabilities using the Normal distribution, conduct significance tests and calculate Type I and Type II error probabilities. They can compute permutations and combinations.",
        "Strategic competence":"Learners are able to select efficient methods for anti-differentiating functions, for finding limits and for sketching graphs. They select from a wide range of trigonometric identities to solve trigonometric equations. They can identify the underlying combinatorial principles of a situation, enabling them to model problem situations and to make appropriate calculations to solve them.",
        "Adaptive reasoning":"Learners understand and use proof techniques such as proof by contradiction and proof by induction. They use their broad knowledge of mathematical structures and operations to solve unfamiliar problems and they can evaluate proposed solutions for reasonableness and relevance."
    }
]
